tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "oven-sh/bun"
tap "th-ch/youtube-music"
brew "openssl@3"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "jpeg-xl"
brew "aom"
brew "node"
brew "bitwarden-cli"
brew "caddy"
brew "chezmoi"
brew "cmake"
brew "cmatrix"
brew "ruby"
brew "cocoapods"
brew "php"
brew "composer"
brew "cowsay"
brew "deno"
brew "docker", link: false
brew "unbound"
brew "gnutls"
brew "python@3.12"
brew "libass"
brew "librist"
brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gcc"
brew "go"
brew "graphviz"
brew "helix"
brew "imagemagick"
brew "lazygit"
brew "libfido2"
brew "llvm"
brew "micro"
brew "midnight-commander"
brew "mingw-w64"
brew "zlib"
brew "mysql-client"
brew "nasm"
brew "neofetch"
brew "neovim"
brew "nginx"
brew "nicotine-plus"
brew "openblas"
brew "numpy"
brew "nushell"
brew "obfs4proxy"
brew "ollama", restart_service: :changed
brew "openjdk"
brew "openjdk@21"
brew "openvino"
brew "openvpn"
brew "pipes-sh"
brew "proxychains-ng"
brew "python@3.11"
brew "qemu"
brew "ranger"
brew "ripgrep"
brew "rustscan"
brew "spoofdpi"
brew "sqlite-utils"
brew "stow"
brew "telnet"
brew "tmux"
brew "tor"
brew "uv"
brew "yt-dlp"
brew "zellij"
brew "heroku/brew/heroku"
brew "oven-sh/bun/bun"
cask "amneziavpn"
cask "bitwarden"
cask "calibre"
cask "docker"
cask "eloston-chromium"
cask "hoppscotch"
cask "iina"
cask "inkscape"
cask "keka"
cask "netnewswire"
cask "obsidian"
cask "openvpn-connect"
cask "pgadmin4"
cask "podman-desktop"
cask "raspberry-pi-imager"
cask "raycast"
cask "rustdesk"
cask "slack"
cask "tigervnc-viewer"
cask "tor-browser"
cask "transmission"
cask "tunnelblick"
cask "utm"
cask "wezterm"
cask "whisky"
cask "wireshark"
cask "youtube-music"
cask "zen-browser"
cask "zoom"
