tap "oven-sh/bun"
brew "bat"
brew "chezmoi"
brew "ffmpeg"
brew "fzf"
brew "helix"
brew "lazygit"
brew "librsvg"
brew "midnight-commander"
brew "nmap"
brew "podman"
brew "uv"
brew "zellij"
brew "oven-sh/bun/bun"
cask "coconutbattery"
cask "discord"
cask "firefox"
cask "ghostty"
cask "gimp"
cask "iina"
cask "imazing"
cask "mac-mouse-fix@2"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "obsidian"
cask "prismlauncher"
cask "raycast"
cask "rustdesk"
cask "spotify"
cask "telegram"
cask "tor-browser"
cask "transmission"
cask "tunnelblick"
cask "ungoogled-chromium"
cask "utm"
cask "visual-studio-code"
vscode "astro-build.astro-vscode"
vscode "editorconfig.editorconfig"
